Repository: Mohamad-Adib-Tawil/office_archiving
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Office Archiving
ar: أرشفة المكتب

# splashMessage
source: Make Your Files Archived
ar: أرشِف ملفاتك

# emptySectionsMessage
source: No sections yet. Tap + to add the first section.
ar: لا توجد أقسام بعد. اضغط على زر + لإضافة أول قسم.

# emptyItemsMessage
source: No items in this section yet
ar: لا توجد عناصر بعد في هذا القسم

# optionsTitle
source: Options of the section
ar: خيارات القسم

source: Edit name
ar: تعديل الاسم

# deleteSection
source: Delete the section
ar: حذف القسم

source: Cancel
ar: إلغاء

# searchItemsTitle
source: Search Items
ar: بحث عن العناصر

# searchLabel
source: Search
ar: بحث

source: No items found.
ar: لا توجد عناصر.

# fileErrorTitle
source: File Error
ar: خطأ في الملف

# fileErrorBody
source: File is missing or invalid
ar: الملف مفقود أو غير صالح

# sectionNameRequired
source: Section name is required
ar: اسم القسم مطلوب

# addSectionTitle
source: Add Section
ar: إضافة قسم

# sectionNameLabel
source: Section name
ar: اسم القسم

# addAction
source: Add
ar: إضافة

# nameRequired
source: Name is required
ar: الاسم مطلوب

# renameItemTitle
source: Rename item
ar: إعادة تسمية العنصر

# newNameLabel
source: New name
ar: الاسم الجديد

# renameAction
source: Rename
ar: إعادة تسمية

# app_settings_title
source: Settings
ar: الإعدادات

# app_language_label
source: Language
ar: اللغة

# app_language_ar
source: Arabic
ar: العربية

# app_language_en
source: English
ar: الإنجليزية

# app_theme_label
source: Theme
ar: الثيم

# theme_light
source: Light
ar: فاتح

# theme_dark
source: Dark
ar: داكن

# theme_blue
source: Blue
ar: أزرق

# theme_purple
source: Purple
ar: بنفسجي

# theme_teal
source: Teal
ar: فيروزي

# theme_orange
source: Orange
ar: برتقالي

# theme_pink
source: Pink
ar: وردي

# theme_indigo
source: Indigo
ar: نيلي

# theme_coral
source: Coral
ar: كورال

# theme_yellow
source: Yellow
ar: أصفر

# theme_system
source: Follow System
ar: تابع النظام

# item_options_title
source: File Options
ar: خيارات الملف

# action_set_as_cover
source: Set as Cover
ar: تعيين كغلاف

# action_rename
source: Rename
ar: إعادة تسمية

# action_delete
source: Delete
ar: حذف

# action_cancel
source: Cancel
ar: إلغاء

# snackbar_cover_set
source: Cover image set
ar: تم تعيين صورة الغلاف

# snackbar_rename_done
source: Name changed
ar: تم تغيير الاسم

# snackbar_item_deleted
source: Item deleted
ar: تم حذف العنصر

# cover_badge
source: Cover
ar: صورة غلاف

# cover_none
source: No cover
ar: بدون صورة غلاف

# cover_set
source: Cover image set
ar: تم تعيين صورة غلاف

# cover_not_set
source: No cover image yet
ar: لم يتم تعيين صورة غلاف بعد

# snackbar_cover_cleared
source: Cover image cleared
ar: تم مسح صورة الغلاف

# settings_tooltip
source: Settings
ar: الإعدادات

# empty_sections_message
source: No sections yet
ar: لا توجد أقسام بعد

# loading_error
source: Failed to load items
ar: فشل في تحميل العناصر

# storage_permission_required
source: Storage permission required to open file
ar: يجب منح صلاحية التخزين لفتح الملف

# file_open_error
source: Error opening file
ar: خطأ أثناء فتح الملف

# generic_error
source: Error
ar: خطأ

source: No file selected
ar: لم يتم تحديد أي ملف

# permission_files_required
source: File access permission required
ar: مطلوب إذن للوصول إلى الملفات

source: No image picked
ar: لم يتم اختيار صورة

source: No image selected
ar: لم يتم تحديد صورة

# rename_section_title
source: Rename Section
ar: إعادة تسمية القسم

# new_name_label
source: New name
ar: الاسم الجديد

source: Set Cover Image
ar: تعيين صورة الغلاف

source: Clear Cover
ar: مسح الغلاف

# unknown_file_type
source: UNKNOWN
ar: غير معروف

# add_item_title
source: Add Item
ar: إضافة عنصر

# add_item_from_memory
source: Add Item from Memory Storage
ar: إضافة عنصر من الذاكرة

source: Add Item from Camera
ar: إضافة عنصر من الكاميرا

source: Add Item from Gallery
ar: إضافة عنصر من المعرض

source: From Files
ar: من الملفات

source: From Gallery
ar: من المعرض

source: From Camera
ar: من الكاميرا

# section_name_empty
source: Please enter section name
ar: يرجى إدخال اسم القسم

# section_name_exists
source: Section name already exists
ar: اسم القسم موجود بالفعل

# theme_ocean_blue
source: Ocean Blue
ar: أزرق المحيط

# theme_sunset_orange
source: Sunset Orange
ar: برتقالي الغروب

# theme_forest_green
source: Forest Green
ar: أخضر الغابة

# theme_royal_purple
source: Royal Purple
ar: بنفسجي ملكي

# theme_rose_gold
source: Rose Gold
ar: ذهبي وردي

# file_cleanup_title
source: File Cleanup
ar: تنظيف الملفات

# analytics_title
source: Storage Analytics
ar: إحصائيات التخزين

source: Scan Files
ar: فحص الملفات

# scan_description
source: Search for duplicate, broken, and large files to improve performance and save space
ar: ابحث عن الملفات المكررة والتالفة والكبيرة لتحسين الأداء وتوفير المساحة

source: Start Scan
ar: بدء الفحص

source: Scanning...
ar: جاري الفحص...

source: files scanned
ar: ملف تم فحصه

source: Scan Results
ar: نتائج الفحص

source: Duplicate Files
ar: الملفات المكررة

source: Broken Files
ar: الملفات التالفة

source: Large Files
ar: الملفات الكبيرة

source: Cleanup Actions
ar: إجراءات التنظيف

source: Cleanup Options
ar: خيارات التنظيف

source: Remove Broken Files
ar: إزالة الملفات التالفة

source: View Duplicate Files
ar: عرض الملفات المكررة

source: View Large Files
ar: عرض الملفات الكبيرة

source: Close
ar: إغلاق

source: Cleaning...
ar: جاري التنظيف...

source: Auto Cleanup
ar: تنظيف تلقائي

source: Space saved
ar: تم توفير

# files_cleaned
source: broken files cleaned
ar: ملف مكسور تم تنظيفه

source: Cleanup error
ar: خطأ في التنظيف

source: Scan error
ar: خطأ في المسح

# no_issues_found
source: No issues found! Your files are well organized
ar: لا توجد مشاكل! ملفاتك منظمة بشكل جيد

source: copies
ar: نسخ

# same_size_files
source: Files with same size
ar: ملفات بنفس الحجم

source: files
ar: ملفات

source: File not found
ar: الملف غير موجود

source: Monthly Report
ar: تقرير شهر

source: Files Added
ar: الملفات المضافة

source: Space Used
ar: المساحة المستخدمة

source: Most Common Type
ar: أكثر نوع ملف

source: Growth Rate
ar: معدل النمو

source: File Type Distribution
ar: توزيع أنواع الملفات

source: Size Distribution
ar: توزيع أحجام الملفات

source: Weekly Usage
ar: الاستخدام الأسبوعي

source: Most Accessed Files
ar: الملفات الأكثر استخداماً

source: No data
ar: لا توجد بيانات

source: Undefined
ar: غير محدد

source: times
ar: مرة

source: minutes ago
ar: دقيقة

source: hours ago
ar: ساعة

source: days ago
ar: يوم

source: Total Files
ar: إجمالي الملفات

source: Sections
ar: الأقسام

source: Storage Size
ar: حجم التخزين

# avg_files_per_section
source: Avg Files/Section
ar: متوسط الملفات/قسم

source: No files to scan
ar: لا توجد ملفات للفحص

# scan_completed_issues
source: Scan completed! Found {count} issues
ar: تم الفحص! وُجد {count} مشكلة

# scan_completed_no_issues
source: Scan completed successfully! No issues found
ar: تم الفحص بنجاح! لا توجد مشاكل

source: Space analyzed
ar: المساحة المحللة

source: Starting scan...
ar: بدء الفحص...

source: Issue
ar: مشكلة

# and_more_items
source: and {count} more items...
ar: و {count} عنصر آخر...

# deleteConfirmTitle
source: Delete
ar: حذف

# deleteConfirmBody
source: Are you sure you want to delete this item? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟ لا يمكن التراجع عن هذا الإجراء.

# deleteAction
source: Delete
ar: حذف

# keepAction
source: Keep
ar: إبقاء

source: Choose image source
ar: اختر مصدر الصورة

# snack_extraction_done
source: Text extracted successfully!
ar: تم استخراج النص بنجاح!

# snack_translation_done
source: Text translated successfully!
ar: تم ترجمة النص بنجاح!

# snack_summary_done
source: Text summarized successfully!
ar: تم تلخيص النص بنجاح!

# snack_copy_done
source: Text copied
ar: تم نسخ النص

# copy_action
source: Copy
ar: نسخ

# ai_features_title
source: AI Features
ar: ميزات الذكاء الاصطناعي

# ai_extract_title
source: Extract text from images
ar: استخراج النص من الصور

# ai_extract_desc
source: Convert images into editable text
ar: قم بتحويل الصور إلى نص قابل للتحرير

# ai_extracted_text_title
source: Extracted text
ar: النص المستخرج

# ai_translate_action
source: Translate text
ar: ترجمة النص

# ai_summary_action
source: Summarize text
ar: تلخيص النص

# ai_translated_text_title
source: Translated text
ar: النص المترجم

# ai_summary_text_title
source: Text summary
ar: ملخص النص

# ai_features_list_title
source: Available AI features
ar: ميزات الذكاء الاصطناعي المتاحة

# ai_feature_extract_title
source: 📷 Extract text from images
ar: 📷 استخراج النص من الصور

# ai_feature_extract_desc
source: Convert scanned images and documents into editable text
ar: تحويل الصور والمستندات الممسوحة إلى نص قابل للتحرير

# ai_feature_translate_title
source: 🌐 Translate documents
ar: 🌐 ترجمة المستندات

# ai_feature_translate_desc
source: Automatically translate texts between Arabic and English
ar: ترجمة النصوص تلقائياً بين العربية والإنجليزية

# ai_feature_summarize_title
source: 📝 Summarize documents
ar: 📝 تلخيص المستندات

# ai_feature_summarize_desc
source: Generate smart summaries for long texts
ar: إنشاء ملخصات ذكية للنصوص الطويلة

# ai_feature_smart_organize_title
source: 🤖 Smart organization
ar: 🤖 التنظيم الذكي

# ai_feature_smart_organize_desc
source: Automatic suggestions to classify and organize files
ar: اقتراحات تلقائية لتصنيف وتنظيم الملفات

# ai_feature_smart_search_title
source: 🔍 Smart search
ar: 🔍 البحث الذكي

# ai_feature_smart_search_desc
source: Search within file and image contents
ar: البحث في محتوى الملفات والصور

source: Coming soon
ar: قريباً

# start_action
source: Start
ar: ابدأ

# processing_ellipsis
source: Processing...
ar: جاري المعالجة...

# tooltip_scanner
source: Scanner
ar: الماسح الضوئي

# tooltip_ai
source: AI Features
ar: الذكاء الاصطناعي

# tooltip_cleaner
source: File Cleaner
ar: منظف الملفات

# tooltip_storage_center
source: Storage Center
ar: مركز التخزين

# storage_center_title
source: Storage Center
ar: مركز التخزين

# accent_color_label
source: Accent color
ar: لون التمييز

# reset_action
source: Reset
ar: إعادة ضبط

# doc_manage_title
source: Document Management
ar: إدارة المستندات

# scan_document_action
source: Scan Document
ar: مسح مستند

# create_pdf_action
source: Create PDF
ar: إنشاء PDF

# digital_signature_action
source: Digital Signature
ar: توقيع رقمي

# merge_files_action
source: Merge Files
ar: دمج ملفات

# tab_images
source: Images
ar: الصور

# tab_documents
source: Documents
ar: المستندات

# tab_signatures
source: Signatures
ar: التوقيعات

# empty_images
source: No scanned images
ar: لا توجد صور ممسوحة

# empty_documents
source: No documents
ar: لا توجد مستندات

# empty_signatures
source: No signatures
ar: لا توجد توقيعات

# empty_hint_add_content
source: Use the buttons above to add new content
ar: استخدم الأزرار أعلاه لإضافة محتوى جديد

# snack_document_added
source: Document added successfully!
ar: تم إضافة المستند بنجاح!

# delete_document_title
source: Delete document
ar: حذف المستند

# delete_document_message
source: Are you sure you want to delete this document?
ar: هل أنت متأكد من حذف هذا المستند؟

# delete_signature_title
source: Delete signature
ar: حذف التوقيع

# delete_signature_message
source: Are you sure you want to delete this signature?
ar: هل أنت متأكد من حذف هذا التوقيع؟

# snack_document_deleted
source: Document deleted
ar: تم حذف المستند

# snack_signature_deleted
source: Signature deleted
ar: تم حذف التوقيع

# snack_pdf_created
source: Document file created successfully!
ar: تم إنشاء ملف المستند بنجاح!

# error_merge_min_files
source: At least two files are required to merge
ar: يجب وجود ملفين على الأقل للدمج

# snack_merge_success
source: Files merged successfully!
ar: تم دمج الملفات بنجاح!

# snack_watermark_added
source: Watermark added successfully!
ar: تم إضافة العلامة المائية بنجاح!

# digital_signature_title
source: Create Digital Signature
ar: إنشاء توقيع رقمي

source: Enter signature text:
ar: أدخل نص التوقيع:

# signature_hint_example
source: Example: John Doe
ar: مثال: محمد أحمد

# create_action
source: Create
ar: إنشاء

source: Document {n}
ar: مستند {n}

source: Signature {n}
ar: توقيع {n}

# view_action
source: View
ar: عرض

# share_action
source: Share
ar: مشاركة

# watermark_action
source: Watermark
ar: علامة مائية

# view_document_title
source: View Document
ar: عرض المستند

# view_file_title
source: View {name}
ar: عرض {name}

# share_prepared_prefix
source: File prepared for sharing:
ar: تم تحضير الملف للمشاركة:

# file_size
source: Size
ar: الحجم

# file_date
source: Date
ar: التاريخ

source: since
ar: منذ

# tooltip_professional_tools
source: Professional Tools
ar: أدوات احترافية

# tools_docs_center_title
source: Tools & Documents Center
ar: مركز الأدوات والملفات

# tab_professional_tools
source: Professional Tools
ar: أدوات احترافية

# coming_soon_message
source: This feature is under development and will be available in the next update
ar: هذه الميزة قيد التطوير وستكون متاحة في التحديث القادم

# ok_action
source: OK
ar: موافق

# pdf_security_title
source: PDF Security & Signature
ar: حماية وتوقيع PDF

# tab_security
source: Security
ar: الحماية

# tab_signature
source: Signature
ar: التوقيع

# tab_watermark
source: Watermark
ar: العلامة المائية

# protect_pdf_action
source: Protect PDF
ar: حماية PDF

# draw_signature_instruction
source: Draw your signature below
ar: ارسم توقيعك في المساحة أدناه

# clear_action
source: Clear
ar: مسح

# preview_action
source: Preview
ar: معاينة

# signature_options_title
source: Signature Options
ar: خيارات التوقيع

# signature_location_title
source: Signature location
ar: موقع التوقيع

# signature_location_hint_last_page_br
source: Bottom-right of the last page
ar: أسفل يمين الصفحة الأخيرة

# signature_size_title
source: Signature size
ar: حجم التوقيع

# signature_size_medium
source: Medium
ar: متوسط

# watermark_settings_title
source: Watermark Settings
ar: إعدادات العلامة المائية

# watermark_text_label
source: Watermark text
ar: نص العلامة المائية

# watermark_text_hint
source: e.g., Confidential, Draft, Company XYZ
ar: مثل: سري، نسخة أولية، شركة XYZ

# transparency_label
source: Transparency
ar: الشفافية

# color_label
source: Color
ar: اللون

source: Document content (Preview)
ar: محتوى المستند (معاينة)

# watermark_templates_title
source: Templates
ar: قوالب جاهزة

# no_pdfs_found
source: No PDF files found
ar: لا توجد ملفات PDF

# signature_preview_title
source: Signature Preview
ar: معاينة التوقيع

# signature_preview_hint
source: This signature will be added to the last page of the document
ar: سيتم إضافة هذا التوقيع للصفحة الأخيرة من المستند

# scan_capture_tools_title
source: Scanning and Capture Tools
ar: أدوات المسح والالتقاط

# tool_scanner_title
source: Document Scanner
ar: ماسح المستندات

# tool_scanner_sub
source: Advanced scan with filters and enhancement
ar: مسح متقدم مع فلاتر وتحسين

# tool_bizcard_title
source: Business Card Scanner
ar: ماسح بطاقات العمل

# tool_bizcard_sub
source: Automatically extract contact info
ar: استخراج معلومات الاتصال تلقائياً

# tool_qr_title
source: QR & Barcode Scanner
ar: ماسح الرموز والباركود

# tool_qr_sub
source: Scan and generate QR and barcodes
ar: مسح وإنشاء رموز QR والباركود

# advanced_pdf_tools_title
source: Advanced PDF Tools
ar: أدوات PDF المتقدمة

# tool_pdf_security_sub
source: Passwords and e-signature
ar: كلمات مرور وتوقيع إلكتروني

# tool_pdf_editor_title
source: PDF Editor
ar: محرر PDF

# tool_pdf_editor_sub
source: Add comments and highlight text
ar: إضافة تعليقات وتمييز النصوص

# tool_pdf_merge_title
source: Merge PDF
ar: دمج PDF

# tool_pdf_merge_sub
source: Combine multiple PDFs into a single file
ar: دمج عدة ملفات PDF في ملف واحد

# extra_tools_title
source: Additional Tools
ar: أدوات إضافية

# tool_report_gen_title
source: Report Generator
ar: مولد التقارير

# tool_report_gen_sub
source: Create professional reports
ar: إنشاء تقارير احترافية

# tool_cloud_backup_title
source: Cloud Backup
ar: النسخ الاحتياطي السحابي

# tool_cloud_backup_sub
source: Sync with cloud services
ar: مزامنة مع الخدمات السحابية

# tool_advanced_share_title
source: Advanced Sharing
ar: مشاركة متقدمة

# tool_advanced_share_sub
source: Share with permission control
ar: مشاركة مع تحكم في الصلاحيات

# header_title_prof_tools
source: Professional tools for document management
ar: أدوات احترافية لإدارة المستندات

# header_sub_prof_tools
source: A comprehensive set of advanced tools to scan, edit, protect, and manage documents professionally
ar: مجموعة شاملة من الأدوات المتقدمة لمسح وتحرير وحماية وإدارة المستندات بطريقة احترافية

# no_sections_available
source: No sections available. Please create a section first.
ar: لا توجد أقسام متاحة. يرجى إنشاء قسم أولاً.

# choose_section_to_scan_title
source: Choose a section to scan
ar: اختر القسم للمسح

# section_default_name
source: Section
ar: قسم

source: No document captured
ar: لم يتم التقاط أي مستند

# scan_failed_prefix
source: Scan failed:
ar: فشل المسح:

# qr_title
source: QR & Barcode Scanner
ar: ماسح الرموز والباركود

# qr_tab_scan
source: Scan
ar: مسح

# qr_tab_generate
source: Generate QR
ar: إنشاء QR

# qr_tab_history
source: History
ar: السجل

# qr_scan_area
source: Scan Area
ar: منطقة المسح

# qr_position_camera
source: Point the camera at the code
ar: ضع الكاميرا على الرمز للمسح

# qr_scan_with_camera
source: Scan with Camera
ar: مسح بالكاميرا

# qr_result
source: Scan Result:
ar: نتيجة المسح:

# copied_done
source: Copied
ar: تم النسخ

# copy_action_short
source: Copy
ar: نسخ

# share_action_short
source: Share
ar: مشاركة

# qr_generate_title
source: Create QR Code
ar: إنشاء رمز QR

source: Text or URL
ar: النص أو الرابط

# enter_text_for_qr
source: Enter text to convert into QR
ar: أدخل النص الذي تريد تحويله لرمز QR

source: Quick templates:
ar: قوالب سريعة:

source: Phone Number
ar: رقم الهاتف

# email_address
source: Email
ar: بريد إلكتروني

source: Geo Location
ar: موقع جغرافي

# qr_preview_title
source: QR Preview
ar: معاينة رمز QR

source: Save as Image
ar: حفظ كصورة

# qr_saved_gallery
source: QR saved to gallery
ar: تم حفظ رمز QR في المعرض

# scan_error_prefix
source: Scan error:
ar: خطأ في المسح:

# save_error_prefix
source: Save error:
ar: خطأ في الحفظ:

# share_error_prefix
source: Share error:
ar: خطأ في المشاركة:

# wifi_settings_title
source: WiFi Settings
ar: إعدادات WiFi

source: Network name (SSID)
ar: اسم الشبكة (SSID)

# password_label
source: Password
ar: كلمة المرور

# security_type_label
source: Security type
ar: نوع الأمان

# scanned_on_prefix
source: Scanned on
ar: تم المسح في

# delete_action
source: Delete
ar: حذف

source: Scanned text from selected image
ar: نص ممسوح من الصورة المحددة

# edit_action
source: Edit
ar: تحرير

# options_action
source: Options
ar: خيارات

# share_options_title
source: Share Options
ar: خيارات المشاركة

# file_name_label
source: File Name
ar: اسم الملف

# share_pdf_single
source: Single PDF
ar: PDF واحد

# share_images_multiple
source: Multiple Images
ar: صور متعددة

# save_to_gallery_action
source: Save to Gallery
ar: حفظ في المعرض

# all_options_title
source: All Options
ar: خيارات شاملة

source: Merge All to PDF
ar: دمج الكل في PDF

source: Extract Text (OCR)
ar: استخراج نص (OCR)

source: No images to edit
ar: لا توجد صور للتحرير

source: No valid image path
ar: لا يوجد مسار صورة صالح

source: No items to share
ar: لا توجد عناصر للمشاركة

source: No valid images
ar: لا توجد صور صالحة

# pdf_created_shared_success
source: PDF created and shared successfully
ar: تم إنشاء ومشاركة PDF بنجاح

# error_prefix
source: Error:
ar: خطأ:

source: No images to share
ar: لا توجد صور للمشاركة

source: No valid images to share
ar: لا توجد صور صالحة للمشاركة

source: No items to merge
ar: لا توجد عناصر للدمج

# merged_success_prefix
source: Merged:
ar: تم الدمج:

# merge_error_prefix
source: Merge error:
ar: خطأ في الدمج:

source: No images for text extraction
ar: لا توجد صور لاستخراج النص منها

source: No text found
ar: لم يتم العثور على نص

# text_extracted_prefix
source: Text extracted:
ar: تم استخراج النص:

# text_extraction_error_prefix
source: Text extraction error:
ar: خطأ في استخراج النص:

source: Saving to gallery...
ar: جاري الحفظ في المعرض...

source: Saved to gallery
ar: تم الحفظ في المعرض

source: No files to copy
ar: لا توجد ملفات للنسخ

source: File paths copied
ar: تم نسخ مسارات الملفات

# copy_error_prefix
source: Copy error:
ar: خطأ في النسخ:

source: OCR Language
ar: لغة OCR

# ocr_auto
source: Auto
ar: تلقائي

# ocr_arabic
source: Arabic
ar: العربية

# ocr_english
source: English
ar: الإنجليزية

# ai_info_header
source: AI Features
ar: ميزات الذكاء الاصطناعي

# ai_info_desc
source: • Advanced local OCR for Arabic and English • Smart local text summarization • Instant translation (requires internet) 🌐 • Smart local file organization • Optional Hugging Face key for enhancement
ar: • OCR متقدم محلي للعربية والإنجليزية • تلخيص ذكي محلي للنصوص • ترجمة فورية (تحتاج إنترنت) 🌐 • تنظيم ذكي محلي للملفات • مفتاح Hugging Face اختياري للتحسين

# select_image_for_ocr
source: Select an image for OCR
ar: اختر صورة لاستخراج النص

# ocr_processing
source: Processing OCR...
ar: جاري معالجة OCR...

source: OCR completed!
ar: تم إكمال OCR!

# ocr_failed_prefix
source: OCR failed:
ar: فشل OCR:

# translation_processing
source: Translating...
ar: جاري الترجمة...

source: Translation completed!
ar: تمت الترجمة!

# translation_failed_prefix
source: Translation failed:
ar: فشلت الترجمة:

# summarization_processing
source: Summarizing...
ar: جاري التلخيص...

source: Summarization completed!
ar: تم التلخيص!

# summarization_failed_prefix
source: Summarization failed:
ar: فشل التلخيص:

# smart_organization_processing
source: Organizing...
ar: جاري التنظيم...

# smart_organization_completed
source: Organization completed!
ar: تم التنظيم!

# smart_organization_failed_prefix
source: Organization failed:
ar: فشل التنظيم:

# api_key_dialog_title
source: Hugging Face API Key
ar: مفتاح Hugging Face API

# api_key_dialog_label
source: Bearer Token (optional)
ar: Bearer Token (اختياري)

# api_key_dialog_helper
source: Leave empty for local use only
ar: اتركه فارغاً للاستخدام المحلي فقط

source: API key saved
ar: تم حفظ مفتاح API

# pdf_ocr_desc
source: Extract text from PDF files
ar: استخراج النص من ملفات PDF

# batch_ocr_title
source: 📚 Batch OCR
ar: 📚 OCR دفعي

# batch_ocr_desc
source: Process multiple images at once
ar: معالجة عدة صور دفعة واحدة

# editor_title
source: Image Editor
ar: محرر الصور

# editor_no_image
source: No image to edit
ar: لا توجد صورة للتحرير

# editor_save_success
source: Image saved successfully!
ar: تم حفظ الصورة بنجاح!

# editor_save_error_prefix
source: Save error:
ar: خطأ في الحفظ:

# editor_rotate_left
source: Rotate Left
ar: تدوير يساراً

# editor_rotate_right
source: Rotate Right
ar: تدوير يميناً

# editor_flip_horizontal
source: Flip Horizontal
ar: قلب أفقي

# editor_flip_vertical
source: Flip Vertical
ar: قلب عمودي

# editor_crop
source: Crop
ar: قص

# editor_filters
source: Filters
ar: فلاتر

# editor_adjust
source: Adjust
ar: ضبط

# editor_brightness
source: Brightness
ar: السطوع

# editor_contrast
source: Contrast
ar: التباين

# editor_saturation
source: Saturation
ar: التشبع

# editor_filter_none
source: None
ar: بدون

# editor_filter_grayscale
source: Grayscale
ar: رمادي

# editor_filter_sepia
source: Sepia
ar: بني داكن

# editor_filter_invert
source: Invert
ar: عكس الألوان

# editor_filter_blur
source: Blur
ar: ضبابية

# editor_reset
source: Reset
ar: إعادة ضبط

# editor_save
source: Save
ar: حفظ

# editor_cancel
source: Cancel
ar: إلغاء

# editor_undo
source: Undo
ar: تراجع

# editor_redo
source: Redo
ar: إعادة

# scanner_title
source: Smart Scanner
ar: ماسح ذكي

# scanner_capture
source: Capture
ar: التقاط

# scanner_flash_on
source: Flash On
ar: الفلاش مفعل

# scanner_flash_off
source: Flash Off
ar: الفلاش مطفأ

# scanner_preview_title
source: Smart Preview
ar: معاينة ذكية

# scanner_filter_original
source: Original
ar: أصلي
