Repository: Mohamad-Adib-Tawil/office_archiving
Catalog: lib/l10n/app_*.arb
Languages: ar

# scanner_filter_enhance
source: Enhance
ar: تحسين

# scanner_filter_bw
source: B&W
ar: أبيض وأسود

# scanner_filter_grayscale
source: Grayscale
ar: رمادي

# scanner_filter_vivid
source: Vivid
ar: ألوان حية

# scanner_retake
source: Retake
ar: إعادة

# scanner_save
source: Save
ar: حفظ

# scanner_saved_prefix
source: Saved
ar: تم حفظ

# scanner_saved_suffix_singular
source: image successfully
ar: صورة بنجاح

# scanner_saved_suffix_plural
source: images successfully
ar: صور بنجاح

# scanner_add_another
source: Add Another Page?
ar: إضافة صفحة أخرى؟

# scanner_add_another_desc
source: Do you want to scan another page?
ar: هل تريد مسح صفحة أخرى؟

# scanner_yes_another
source: Yes, Add Another
ar: نعم، أضف أخرى

# scanner_done
source: Done
ar: انتهيت

# scanner_no_camera
source: No camera available
ar: لا توجد كاميرا متاحة

# scanner_camera_error
source: Camera initialization error
ar: خطأ في تهيئة الكاميرا

# zoom_reset_tooltip
source: Reset Zoom
ar: إعادة تعيين التكبير

# file_info_tooltip
source: File Info
ar: معلومات الملف

# name_label
source: Name
ar: الاسم

# path_label
source: Path
ar: المسار

# file_missing_hint
source: File deleted or moved from original location
ar: تم حذف الملف أو نقله من موقعه الأصلي
